{
  "backend/main.mo": "Empty Motoko actor with no methods or state, serving as a placeholder backend.",
  "feature_evidence.json": "Feature evidence report documenting three removal features for the Contact page: phone number, address, and map display removal, all with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the Shark LAN gaming event landing page components, pages, and styling.",
  "frontend/index.css": "Tailwind base configuration with OKLCH color system variables for light and dark themes, defining design tokens for backgrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Shark LAN application.",
  "frontend/src/App.tsx": "TanStack Router configuration defining five routes (Home, Tickets, Schedule, Support, Contact) with shared Layout component as root.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year, caffeine.ai attribution with UTM tracking, and animated heart icon.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing consistent structure with Navigation header, Outlet for page content, and Footer across all routes.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation header with Shark LAN branding, gamepad icon, and five cartoon-styled tabs with neon glow effects and active state highlighting.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP actor creation with Internet Identity authentication, handling both authenticated and anonymous actors with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file as the backend has no methods for this static landing page.",
  "frontend/src/index.css": "Global styles with OKLCH color system for gaming theme, custom cartoon text effects, neon glow shadows, and animations (float, wiggle, pulse-glow, bounce-slow).",
  "frontend/src/main.tsx": "React application entry point wrapping App with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying email addresses (info@sharklan.com, support@sharklan.com) with cartoon-styled UI elements, location icon, and a tip directing users to the Support page for FAQs.",
  "frontend/src/pages/Home.tsx": "Homepage featuring a hero banner with Shark LAN branding, shark mascot image, and three highlight cards showcasing high energy gaming, 50 player capacity, and epic prizes with animated cartoon styling.",
  "frontend/src/pages/Schedule.tsx": "Event schedule page with day selector (Day 1/Day 2) displaying tournament timelines for various games (Fortnite, Rocket League, Valorant, etc.) and a list of featured games, all with TBD dates.",
  "frontend/src/pages/Support.tsx": "Support center page with section selector for FAQs, event rules, troubleshooting guides, and a contact form, providing comprehensive help resources for attendees.",
  "frontend/src/pages/Tickets.tsx": "Tickets page displaying three tiers (Bronze £5, Silver £10, Gold £15) with numbered tickets (#001-050), feature lists, and event info highlighting BYO PC/console and 50 player capacity.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, sidebar variants, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a Shark LAN gaming event website with multi-tab navigation (Home, Tickets, Schedule/Events, Support, Contact/Location) and animated/cartoon styling. Contains architectural notes, existing features for all tabs, and requirements for vibrant teen-friendly design with neon color palette."
}